SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32MG26/Include/efr32mg26b220f3200im48.h
/* Instance macros for EUSART */
#define EUSART(n)                        (((n) == 0) ? EUSART0   \
                                          : ((n) == 1) ? EUSART1 \
                                          : ((n) == 2) ? EUSART2 \
                                          : ((n) == 3) ? EUSART3 \
                                          : 0x0UL)
#define EUSART_NUM(ref)                  (((ref) == EUSART0) ? 0   \
                                          : ((ref) == EUSART1) ? 1 \
                                          : ((ref) == EUSART2) ? 2 \
                                          : ((ref) == EUSART3) ? 3 \
                                          : -1)
#define EUSART_EM2_CAPABLE(n)            (((n) == 0) ? EUSART0_EM2_CAPABLE   \
                                          : ((n) == 1) ? EUSART1_EM2_CAPABLE \
                                          : ((n) == 2) ? EUSART2_EM2_CAPABLE \
                                          : ((n) == 3) ? EUSART3_EM2_CAPABLE \
                                          : 0x0UL)
#define EUSART_NOT_EM2_CAPABLE(n)        (((n) == 0) ? EUSART0_NOT_EM2_CAPABLE   \
                                          : ((n) == 1) ? EUSART1_NOT_EM2_CAPABLE \
                                          : ((n) == 2) ? EUSART2_NOT_EM2_CAPABLE \
                                          : ((n) == 3) ? EUSART3_NOT_EM2_CAPABLE \
                                          : 0x0UL)

/* Instance macros for HFRCO */
#define HFRCO(n)                         (((n) == 0) ? HFRCO0      \
                                          : ((n) == 1) ? HFRCOEM23 \
                                          : 0x0UL)
#define HFRCO_NUM(ref)                   (((ref) == HFRCO0) ? 0      \
                                          : ((ref) == HFRCOEM23) ? 1 \
                                          : -1)
#define HFRCO_EM23ONDEMAND(n)            (((n) == 0) ? HFRCO0_EM23ONDEMAND      \
                                          : ((n) == 1) ? HFRCOEM23_EM23ONDEMAND \
                                          : 0x0UL)
#define HFRCO_EXCLUDEEM23ONDEMAND(n)     (((n) == 0) ? HFRCO0_EXCLUDEEM23ONDEMAND      \
                                          : ((n) == 1) ? HFRCOEM23_EXCLUDEEM23ONDEMAND \
                                          : 0x0UL)

/* Instance macros for I2C */
#define I2C(n)                           (((n) == 0) ? I2C0   \
                                          : ((n) == 1) ? I2C1 \
                                          : ((n) == 2) ? I2C2 \
                                          : ((n) == 3) ? I2C3 \
                                          : 0x0UL)
#define I2C_NUM(ref)                     (((ref) == I2C0) ? 0   \
                                          : ((ref) == I2C1) ? 1 \
                                          : ((ref) == I2C2) ? 2 \
                                          : ((ref) == I2C3) ? 3 \
                                          : -1)
#define I2C_DELAY(n)                     (((n) == 0) ? I2C0_DELAY   \
                                          : ((n) == 1) ? I2C1_DELAY \
                                          : ((n) == 2) ? I2C2_DELAY \
                                          : ((n) == 3) ? I2C3_DELAY \
                                          : 0x0UL)
#define I2C_DELAY_CHAIN_NUM(n)           (((n) == 0) ? I2C0_DELAY_CHAIN_NUM   \
                                          : ((n) == 1) ? I2C1_DELAY_CHAIN_NUM \
                                          : ((n) == 2) ? I2C2_DELAY_CHAIN_NUM \
                                          : ((n) == 3) ? I2C3_DELAY_CHAIN_NUM \
                                          : 0x0UL)

/* Instance macros for MPAHBRAM */
#define MPAHBRAM(n)                      (((n) == 0) ? DMEM0   \
                                          : ((n) == 1) ? DMEM1 \
                                          : 0x0UL)
#define MPAHBRAM_NUM(ref)                (((ref) == DMEM0) ? 0   \
                                          : ((ref) == DMEM1) ? 1 \
                                          : -1)
#define MPAHBRAM_AHB_DATA_WIDTH(n)       (((n) == 0) ? DMEM0_AHB_DATA_WIDTH   \
                                          : ((n) == 1) ? DMEM1_AHB_DATA_WIDTH \
                                          : 0x0UL)
#define MPAHBRAM_BANK0_SIZE(n)           (((n) == 0) ? DMEM0_BANK0_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK0_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK10_SIZE(n)          (((n) == 0) ? DMEM0_BANK10_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK10_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK11_SIZE(n)          (((n) == 0) ? DMEM0_BANK11_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK11_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK12_SIZE(n)          (((n) == 0) ? DMEM0_BANK12_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK12_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK13_SIZE(n)          (((n) == 0) ? DMEM0_BANK13_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK13_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK14_SIZE(n)          (((n) == 0) ? DMEM0_BANK14_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK14_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK15_SIZE(n)          (((n) == 0) ? DMEM0_BANK15_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK15_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK16_SIZE(n)          (((n) == 0) ? DMEM0_BANK16_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK16_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK17_SIZE(n)          (((n) == 0) ? DMEM0_BANK17_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK17_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK18_SIZE(n)          (((n) == 0) ? DMEM0_BANK18_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK18_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK19_SIZE(n)          (((n) == 0) ? DMEM0_BANK19_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK19_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK1_SIZE(n)           (((n) == 0) ? DMEM0_BANK1_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK1_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK20_SIZE(n)          (((n) == 0) ? DMEM0_BANK20_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK20_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK21_SIZE(n)          (((n) == 0) ? DMEM0_BANK21_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK21_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK22_SIZE(n)          (((n) == 0) ? DMEM0_BANK22_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK22_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK23_SIZE(n)          (((n) == 0) ? DMEM0_BANK23_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK23_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK24_SIZE(n)          (((n) == 0) ? DMEM0_BANK24_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK24_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK25_SIZE(n)          (((n) == 0) ? DMEM0_BANK25_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK25_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK26_SIZE(n)          (((n) == 0) ? DMEM0_BANK26_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK26_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK27_SIZE(n)          (((n) == 0) ? DMEM0_BANK27_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK27_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK28_SIZE(n)          (((n) == 0) ? DMEM0_BANK28_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK28_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK29_SIZE(n)          (((n) == 0) ? DMEM0_BANK29_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK29_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK2_SIZE(n)           (((n) == 0) ? DMEM0_BANK2_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK2_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK30_SIZE(n)          (((n) == 0) ? DMEM0_BANK30_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK30_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK31_SIZE(n)          (((n) == 0) ? DMEM0_BANK31_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK31_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK3_SIZE(n)           (((n) == 0) ? DMEM0_BANK3_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK3_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK4_SIZE(n)           (((n) == 0) ? DMEM0_BANK4_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK4_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK5_SIZE(n)           (((n) == 0) ? DMEM0_BANK5_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK5_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK6_SIZE(n)           (((n) == 0) ? DMEM0_BANK6_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK6_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK7_SIZE(n)           (((n) == 0) ? DMEM0_BANK7_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK7_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK8_SIZE(n)           (((n) == 0) ? DMEM0_BANK8_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK8_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_BANK9_SIZE(n)           (((n) == 0) ? DMEM0_BANK9_SIZE   \
                                          : ((n) == 1) ? DMEM1_BANK9_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_ECC_EXCLUDE(n)          (((n) == 0) ? DMEM0_ECC_EXCLUDE   \
                                          : ((n) == 1) ? DMEM1_ECC_EXCLUDE \
                                          : 0x0UL)
#define MPAHBRAM_MEM_SIZE(n)             (((n) == 0) ? DMEM0_MEM_SIZE   \
                                          : ((n) == 1) ? DMEM1_MEM_SIZE \
                                          : 0x0UL)
#define MPAHBRAM_NUM_BANKS(n)            (((n) == 0) ? DMEM0_NUM_BANKS   \
                                          : ((n) == 1) ? DMEM1_NUM_BANKS \
                                          : 0x0UL)
#define MPAHBRAM_NUM_PORTS(n)            (((n) == 0) ? DMEM0_NUM_PORTS   \
                                          : ((n) == 1) ? DMEM1_NUM_PORTS \
                                          : 0x0UL)
#define MPAHBRAM_NUM_PORTS_IS_2(n)       (((n) == 0) ? DMEM0_NUM_PORTS_IS_2   \
                                          : ((n) == 1) ? DMEM1_NUM_PORTS_IS_2 \
                                          : 0x0UL)
#define MPAHBRAM_WAITSTATE_EXCLUDE(n)    (((n) == 0) ? DMEM0_WAITSTATE_EXCLUDE   \
                                          : ((n) == 1) ? DMEM1_WAITSTATE_EXCLUDE \
                                          : 0x0UL)

